{"id":218,"date":"2017-10-28T13:31:27","date_gmt":"2017-10-28T13:31:27","guid":{"rendered":"http:\/\/tourpress.inspirydemos.com\/?p=218"},"modified":"2017-10-28T13:31:27","modified_gmt":"2017-10-28T13:31:27","slug":"becoming-more-productive","status":"publish","type":"post","link":"https:\/\/tourpress.inspirythemes.com\/blog\/becoming-more-productive\/","title":{"rendered":"Becoming More Productive"},"content":{"rendered":"<p>I am not going to tell you where you can buy a magic pill to take away any effort you need to make to achieve what you want, but I am going to share with you few ways that really work to be more productive.<\/p>\n<p>It is not only about applying the best practices, but also applying yourself more and in different ways. To increase your productivity, you need to ‘be more productive’ and this means:<\/p>\n<h2>Get Out of Your Way<\/h2>\n<p>How many excuses do you have and live by each day? ‘I couldn’t do this because…or I don’t have time to do this because…’ I am not saying that your excuses might not be valid, but I strongly believe that more than 80% of the time, they are not real; it is an avoidance technique that we subconsciously use.<\/p>\n<p>Not dealing with procrastination is a clear example of standing in your own way. Nobody else is going to suddenly make it go away; it will be there the next time you attempt to do whatever it is that you are procrastinating. Put results before comfort, get out of your own way, and stop making excuses. Like Nike says, “just do it!”<\/p>\n<p>Ask yourself honestly: ‘How are you standing in your own way in some areas?’<\/p>\n<h2>Develop a Productive Mindset<\/h2>\n<p>Productive individuals think very differently than others. You need to challenge your thoughts and develop a productive mindset. What is the main difference? A productive person doesn’t think along the lines of…<\/p>\n<ul>\n<li>‘Oh no, I have got so much to do. What am I going to do?’<\/li>\n<li>‘I am so stressed. I can’t think straight’<\/li>\n<li>‘I am so overwhelmed. I wish this…or that…’<\/li>\n<\/ul>\n<p>But instead…<\/p>\n<ul>\n<li>I need to do x and y. What is the best way for me to get everything done?<\/li>\n<li>What is causing the stress? What needs to change so that I manage this situation better?<\/li>\n<li>What can I do to improve this, considering the current circumstances?<\/li>\n<\/ul>\n<p>The words and phrases you use immediately empower you or they don’t; they either make you feel better or more stressed. The words you use, ‘your self talk,’ is pivotal to everything in life, because you always act on them, whether they support you or not.<\/p>\n<h2>Adjust Stuff to Suit Your Specific Needs<\/h2>\n<p>Time management supports productivity; they go hand-in-hand. Most people often overlook the fact that time management is not a cookie cutter though, and what might suit you won’t necessarily work for your colleague or best friend.<\/p>\n<p>You need to take the advice given from a meta view and then adjust it to your situation specifically. Think about clothes shopping: sometimes the suit doesn’t fit and you need to make adjustments and tweaks so that it fits your body <span class=\"skimlinks-unlinked\">perfectly.The<\/span> same is true with time management and being more productive. You need to personalize what you read to your needs.<\/p>\n<p>If some tips and techniques don’t work for you, instead of throwing in the towel, find a way to adjust them to suit your situation. Otherwise, it is like wanting to get healthier but resisting a change in lifestyle. You can’t avoid it, so if you don’t like it, adjust it to suit your specific needs and make it work for you.<\/p>\n<h2>Find Out Your Time Wasters<\/h2>\n<p>We all have time wasters, but most of us don’t even know what they are. If you can identify your biggest time wasters, the activities or situations that throw you off course, distract or interrupt you, or the bad habits that keep you from performing better, you will improve your results much more quickly.<\/p>\n<p>If you try to study and apply different techniques, and you ignore your current time waster, the effort will remain fruitless.  If you just aim to change one of your worst time management habits, you will change your results immediately. It will most likely also give you the impetus to change what else isn’t working, once you feel the reward of your efforts and you see the clear connection between what you do and what your reality is.<\/p>\n<p>Think about one thing, that if you changed right now, would have the biggest positive influence on your productivity. Write this down, think about what causes or contributes to this and what your solution will be moving forward.<\/p>\n<p>Don’t forget to put results before comfort, if that is what you really want. Most people give up without ever knowing that they really can achieve their goals, meet their objectives and transform their lives!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I am not going to tell you where you can buy a magic pill to take away any effort you need to make to achieve what you want, but I am going to share with you few ways that really work to be more productive. It is not only about applying the best practices, but [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":502,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[17,18,19],"tags":[23,25,28,32],"_links":{"self":[{"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/posts\/218"}],"collection":[{"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/comments?post=218"}],"version-history":[{"count":0,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/posts\/218\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/media\/502"}],"wp:attachment":[{"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/media?parent=218"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/categories?post=218"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/tags?post=218"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}