{"id":240,"date":"2017-12-11T13:52:04","date_gmt":"2017-12-11T13:52:04","guid":{"rendered":"http:\/\/tourpress.inspirydemos.com\/?p=240"},"modified":"2017-12-11T13:52:04","modified_gmt":"2017-12-11T13:52:04","slug":"try-living-a-simple-life","status":"publish","type":"post","link":"https:\/\/tourpress.inspirythemes.com\/blog\/try-living-a-simple-life\/","title":{"rendered":"Try Living A Simple Life"},"content":{"rendered":"<p>Many people want a simple life away from all the chaos that seems self-inflicted. The first step to embracing this new form of lifestyle is to understand what simplicity means to you and then live by that definition. Here are some suggestions on how to live a simple life.<\/p>\n<h3>Slow Down<\/h3>\n<p>There are times when you are so used to doing everything in a hurry that you don’t notice how fast-paced your life has become. Simply reading the words, “Slow down,” will allow you to pause for a moment and notice. This step is mentioned first so you will carry the thought with you throughout this article and beyond.<\/p>\n<ul>\n<li>Avoid multi-tasking. It has become popular, if not clichéd, to multi-task. Research indicates that there is a point where the quality of what you are doing declines when you try to focus on too many tasks at once. Just because everyone is doing it doesn’t mean you have to.<\/li>\n<li>Find your threshold of diminishing return on the number of tasks you can work on. Your goal is to do things well so you can feel good about your accomplishments.<\/li>\n<li>Take frequent breaks while working.<\/li>\n<\/ul>\n<h3>Eliminate Extras<\/h3>\n<p>The concept of conspicuous consumption may describe your life. It entails lavish or wasteful spending that attempts to show others your level of social prestige. Simplifying your life will drastically cut into the amount of “extras” you have grown accustom to. The goal is to cut out the extra expenses so you won’t be tied down by financial obligations.<\/p>\n<ul>\n<li>Question if you really need that third ipad or newest electronic gadget, or twice-a-day trip through the coffee retailer drive-thru. Just say “no” to yourself, and “yes” to your desire to live a simpler and more peaceful life. Each time you are faced with a decision, you can make a good decision.<\/li>\n<li>Find fulfillment in the simple things in life by spending time with friends, in nature, or building something with your own two hands. Intrinsic rewards will improve your motivation and overall satisfaction with your life.<\/li>\n<\/ul>\n<h3>Practice Empathy and Compassion to Create Peace<\/h3>\n<p>The ability to appreciate someone else’s struggle is an important skill to develop. It comes easy to some people, and not to others. You know how you would like to be treated, so use that as a guide when trying to forgive someone.<\/p>\n<ul>\n<li>If you want to practice empathy and compassion start by reaching out to a family member or friend and offer to help her in some way. Perhaps you could run an errand for her, or do something simple like unload groceries, or water her plants. The point of this exercise is to provide to others the feelings and actions you appreciate when someone does the same for you.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Many people want a simple life away from all the chaos that seems self-inflicted. The first step to embracing this new form of lifestyle is to understand what simplicity means to you and then live by that definition. Here are some suggestions on how to live a simple life. Slow Down There are times when you [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":501,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[16,17,19],"tags":[24,25,28],"_links":{"self":[{"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/posts\/240"}],"collection":[{"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/comments?post=240"}],"version-history":[{"count":0,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/posts\/240\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/media\/501"}],"wp:attachment":[{"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/media?parent=240"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/categories?post=240"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/tags?post=240"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}