{"id":242,"date":"2017-12-09T13:53:04","date_gmt":"2017-12-09T13:53:04","guid":{"rendered":"http:\/\/tourpress.inspirydemos.com\/?p=242"},"modified":"2017-12-09T13:53:04","modified_gmt":"2017-12-09T13:53:04","slug":"make-running-a-part-of-life","status":"publish","type":"post","link":"https:\/\/tourpress.inspirythemes.com\/blog\/make-running-a-part-of-life\/","title":{"rendered":"Make Running A Part of Life"},"content":{"rendered":"<p>Running improves your cardiovascular strength, lowers bad cholesterol and speeds up your metabolism. Not to mention the immense positive feelings and self-esteem that is part of every successful run. It’s obviously no surprise why running is such an immensely popular exercise.<\/p>\n<h3>Set Goals<\/h3>\n<p>Establishing a goal for each run (even if it’s just to not walk!) creates benchmarks of your progress and a sense of accomplishment. “I used telephone poles when I was getting started,” says Feller. “Each time I ran, I told myself to make it to ‘one more pole.’” Eventually, you might find yourself setting even crazier goals, says Elizabeth Maiuolo of Running and the City, “like running over all of the NYC bridges or covering three different parks in one run.”<\/p>\n<h3>Slow Down<\/h3>\n<p>“Don’t even think about pace at the beginning,” says Amanda Loudin, the voice behind Miss Zippy. “Many people get discouraged at first because they want to run ‘fast.’ So they go out and kill themselves, then feel dejected and discouraged.” Coach Ryan Knapp of Out and Back emphasizes running at a conversational pace, meaning you should be able to talk on-the-go. While it may go against the “No pain. No gain.” mentality, it “ensures you are building your aerobic endurance and teaching your body to become more efficient, which is the key to running,” he says.<\/p>\n<h3>Buddy Up<\/h3>\n<p>Yes, it can be isolating to run alone, but we say there’s plenty of road to share. “Ask a friend you haven’t seen in a while to run with you,” says Jocelyn Bonneau, better known as Enthusiastic Runner. “Catch up while running and the miles will fly by as you chat!” Julie Curtis of ROJ Running adds that your date could also be a romantic one. “Studies have shown couples who run together, stay together,” she says. “Take your crush out for a little jog or reignite passion in your long term relationship. That post-workout glow could lead to a few <i>more<\/i> calories burned — if you know what I’m saying.”<\/p>\n<h3>Treat Yourself<\/h3>\n<p>We hate to sound shallow, but sometimes there’s nothing like some new gear to get us going. “A flashy training outfit will make me want to run faster and longer,” admits Maiuolo. Michelle Roos of Pawsitively Delightful also abides by this approach. “If I have time (and money), I will buy either a new pair of shorts or a tank that will act as a reward for all of the hard work that I’ve done up until then,” she says. “If it’s something I know I’ll want to race in later, I can test it out!”<\/p>\n<p>Maybe running isn’t for everyone, but you won’t know until you try — and these are some ways to at least have fun while doing so. But according to Feller, the best tip we can offer is to power through. “When you’re getting started, the fight is as much mental as it is physical,” she says. “You want running to be fun right away? I assure you, it’s not going to be. But once you can find the mental strength to push through the initial tough ones, the runs that follow will truly be a blast.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Running improves your cardiovascular strength, lowers bad cholesterol and speeds up your metabolism. Not to mention the immense positive feelings and self-esteem that is part of every successful run. It’s obviously no surprise why running is such an immensely popular exercise. Set Goals Establishing a goal for each run (even if it’s just to not [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":499,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[16,18,20],"tags":[23,25,27],"_links":{"self":[{"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/posts\/242"}],"collection":[{"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/comments?post=242"}],"version-history":[{"count":0,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/posts\/242\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/media\/499"}],"wp:attachment":[{"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/media?parent=242"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/categories?post=242"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/tags?post=242"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}