{"id":244,"date":"2017-12-10T13:54:05","date_gmt":"2017-12-10T13:54:05","guid":{"rendered":"http:\/\/tourpress.inspirydemos.com\/?p=244"},"modified":"2017-12-10T13:54:05","modified_gmt":"2017-12-10T13:54:05","slug":"start-writing-a-journal","status":"publish","type":"post","link":"https:\/\/tourpress.inspirythemes.com\/blog\/start-writing-a-journal\/","title":{"rendered":"Start Writing A Journal"},"content":{"rendered":"<p>An ideal time to write, comfortable digs, a great pen, and endless sheets of fabulous paper can make journaling more enjoyable. But if you think you can’t start journaling right this minute because you lack the right tools, you’re totally kidding yourself.<\/p>\n<p>One of the most attractive elements of journaling is its simplicity. Journal writing has virtually no barriers to entry; if you can hold a pen, you can keep a journal. It’s open to all: young and old, rich and poor, homebodies and wanderers.<\/p>\n<p>You can buy a composition book for a buck at any drug store. You only need twenty minutes a day, the same amount of time you’ll spend watching commercials during the evening news. And the most complicated piece of equipment required is a ballpoint pen. If you can’t figure out how to work one of those, you can use a pencil.<\/p>\n<p>I chuckle to myself when I hear starry-eyed dreamers breathlessly declare, “I want to be a writer.” As though putting words on paper is like climbing Kilimanjaro or winning the lottery – not something attainable at 2:30 this afternoon. Mentally, I thrust a legal pad into their eager hands. “Here – write.” Presto! You’re a writer.<\/p>\n<p>Writing makes you a writer. Just like running makes you a runner. You don’t stand around at cocktail parties saying, “I’d like to be a runner someday.” You strap on your Nikes and hit the pavement, preferably today.<\/p>\n<p>You want to be a journal writer? Put down that mouse – right now – I’ll wait. Grab a piece of paper out of the recycling bin with at least one blank side, and put words on it for twenty minutes. Then come back to your computer.<\/p>\n<h2>Keep it Simple<\/h2>\n<p>Journal writing at its core is simple. You get some paper and a pen, you write a few pages about what’s going on. You do it again tomorrow. And the next day.<\/p>\n<p>We humans are a curious bunch — we make things needlessly complicated. So if you feel yourself getting mired in whether or not you’re doing it right, what kind of journal to use, when you “should” write, or if the color of your pen will affect the outcome, take a breath and get back to basics.<\/p>\n<p>Words, on a page. It’s really that simple.<\/p>\n<h2>Do it Frequently<\/h2>\n<p>Writing frequently supports the habit part of journaling. It allows you to witness the ebb and flow of your life. It gives you perspective that you won’t always feel this way — after all, you didn’t feel this way yesterday.<\/p>\n<p>Daily journaling provides the most benefits and the best results. If you only write when you “need to,” you will forever be in crisis management. Your journal will be filled with dire consequences and high stakes. And you’ll continue to live in reactionary mode.<\/p>\n<blockquote><p>The beauty of frequent journaling is that it helps you grow as a person, helps you recognize patterns in your life, and helps you gain perspective and control over your environment.<\/p><\/blockquote>\n<p>On the other hand, just do your best. If you can’t make time for journaling <em>every<\/em> day, do it as often as you can. A couple times a week is better than not at all. And if you miss some time, just get back to it without beating yourself up.<\/p>\n<p>Journaling should support you and make you feel good. It’s not another Task to be checked off your Action Item List or fodder for self-flagellation when you “fail.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>An ideal time to write, comfortable digs, a great pen, and endless sheets of fabulous paper can make journaling more enjoyable. But if you think you can’t start journaling right this minute because you lack the right tools, you’re totally kidding yourself. One of the most attractive elements of journaling is its simplicity. Journal writing [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":495,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[16,18,19],"tags":[23,29,32],"_links":{"self":[{"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/posts\/244"}],"collection":[{"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/comments?post=244"}],"version-history":[{"count":0,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/posts\/244\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/media\/495"}],"wp:attachment":[{"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/media?parent=244"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/categories?post=244"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/tags?post=244"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}