{"id":246,"date":"2017-10-28T13:54:53","date_gmt":"2017-10-28T13:54:53","guid":{"rendered":"http:\/\/tourpress.inspirydemos.com\/?p=246"},"modified":"2017-10-28T13:54:53","modified_gmt":"2017-10-28T13:54:53","slug":"take-breaks-to-improve-your-productivity","status":"publish","type":"post","link":"https:\/\/tourpress.inspirythemes.com\/blog\/take-breaks-to-improve-your-productivity\/","title":{"rendered":"Improve Your Productivity"},"content":{"rendered":"<p>Every self-help program talks about the importance of taking a 10-15 minute break to boost your productivity. Breaks give us much needed time to rest our eyes, move around, stretch our stiff muscles, get more blood and oxygen flowing to our brain, to unwind and obtain a fresh outlook on complex work problems.<\/p>\n<blockquote><p>There is just one problem – <strong>we often forget to take them.<\/strong>  Going to the bathroom, grabbing a cup of coffee or checking Facebook updates does not count, as these activities hardly give us enough time to energize our body and restore our concentration and productivity.<\/p><\/blockquote>\n<p>As strange as it may sound, taking regular breaks throughout the work day requires discipline and a little bit of planning. Actually, the reason why so many people push themselves to the limit of exhaustion is simple – they just can not think of any interesting activities they can do, during their break time. So they end up working for 4-5 hours straight until their body offers them a painful reminder.<\/p>\n<p>If this sounds like you, here are some Counter-Intuitive Break ideas that help to restore your energy, sharpen your focus, boost productivity and avoid burnout at work.<\/p>\n<p><strong>Share your break with a co-worker.<\/strong> Alone, you might not always have the strength to pull yourself away from the computer, but if you have a friend taking breaks with you, it is much easier to stick with your break routine. In addition, it offers a great opportunity to bond with your colleagues and get to know them better.<\/p>\n<p><strong>Step outside for a fresh perspective.<\/strong> Leaving a stuffy office and letting yourself enjoy the warmth of the sunlight, the coolness of a breeze and the freshness of the spring air can do miracles to your mind and body. You will come back feeling rejuvenated and ready to approach your work with new energy and a fresh perspective.<\/p>\n<p><strong>Close your eyes and take 10 deep breaths.<\/strong> Stand up and walk away from your desk. Find a quiet place, where you can sit down, close your eyes, smile to yourself and take a few deep breaths. Imagine tension, stress and anxiety leaving your body as you breathe out, and peacefulness, positivity and relaxation filling your mind with every breath that you take.<\/p>\n<p><strong>Re-waterize yourself.<\/strong> First drink a full glass of water. Second splash some water on your face: warm to relax, cold – to wake up and energize yourself.<\/p>\n<p><strong>Rock out to some great music.<\/strong> Music is a great mood changer, especially if you allow yourself to get up and move with it. Just a few minutes of humming and dancing can put a smile on your face and get your blood moving.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Every self-help program talks about the importance of taking a 10-15 minute break to boost your productivity. Breaks give us much needed time to rest our eyes, move around, stretch our stiff muscles, get more blood and oxygen flowing to our brain, to unwind and obtain a fresh outlook on complex work problems. There is just [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":500,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[16],"tags":[23,24,25,32],"_links":{"self":[{"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/posts\/246"}],"collection":[{"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/comments?post=246"}],"version-history":[{"count":0,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/posts\/246\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/media\/500"}],"wp:attachment":[{"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/media?parent=246"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/categories?post=246"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/tourpress.inspirythemes.com\/wp-json\/wp\/v2\/tags?post=246"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}